AvatarBg111/Diploma_project_CNC_machine/Software_STM32H750/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include <stdbool.h>

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
extern uint8_t points_detected;

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define USER_BUT_A_Pin GPIO_PIN_2
#define USER_BUT_A_GPIO_Port GPIOE
#define USER_BUT_B_Pin GPIO_PIN_4
#define USER_BUT_B_GPIO_Port GPIOE
#define USER_BUT_C_Pin GPIO_PIN_6
#define USER_BUT_C_GPIO_Port GPIOE
#define USER_BUT_D_Pin GPIO_PIN_13
#define USER_BUT_D_GPIO_Port GPIOC
#define USER_BUT_E_Pin GPIO_PIN_0
#define USER_BUT_E_GPIO_Port GPIOC
#define USER_BUT_F_Pin GPIO_PIN_2
#define USER_BUT_F_GPIO_Port GPIOC
#define PENDANT_RX_Pin GPIO_PIN_0
#define PENDANT_RX_GPIO_Port GPIOA
#define PENDANT_TX_Pin GPIO_PIN_1
#define PENDANT_TX_GPIO_Port GPIOA
#define MPG_RX_Pin GPIO_PIN_2
#define MPG_RX_GPIO_Port GPIOA
#define MPG_TX_Pin GPIO_PIN_3
#define MPG_TX_GPIO_Port GPIOA
#define FT5436_RESET_Pin GPIO_PIN_6
#define FT5436_RESET_GPIO_Port GPIOA
#define TFT_D0_Pin GPIO_PIN_4
#define TFT_D0_GPIO_Port GPIOC
#define TFT_D1_Pin GPIO_PIN_5
#define TFT_D1_GPIO_Port GPIOC
#define TFT_D2_Pin GPIO_PIN_0
#define TFT_D2_GPIO_Port GPIOB
#define TFT_D3_Pin GPIO_PIN_1
#define TFT_D3_GPIO_Port GPIOB
#define TFT_D4_Pin GPIO_PIN_2
#define TFT_D4_GPIO_Port GPIOB
#define TFT_D5_Pin GPIO_PIN_7
#define TFT_D5_GPIO_Port GPIOE
#define TFT_D6_Pin GPIO_PIN_8
#define TFT_D6_GPIO_Port GPIOE
#define TFT_D7_Pin GPIO_PIN_9
#define TFT_D7_GPIO_Port GPIOE
#define TFT_D8_Pin GPIO_PIN_10
#define TFT_D8_GPIO_Port GPIOE
#define TFT_D9_Pin GPIO_PIN_11
#define TFT_D9_GPIO_Port GPIOE
#define TFT_D10_Pin GPIO_PIN_12
#define TFT_D10_GPIO_Port GPIOE
#define TFT_D11_Pin GPIO_PIN_13
#define TFT_D11_GPIO_Port GPIOE
#define TFT_D12_Pin GPIO_PIN_14
#define TFT_D12_GPIO_Port GPIOE
#define TFT_D13_Pin GPIO_PIN_15
#define TFT_D13_GPIO_Port GPIOE
#define TFT_D14_Pin GPIO_PIN_10
#define TFT_D14_GPIO_Port GPIOB
#define TFT_D15_Pin GPIO_PIN_11
#define TFT_D15_GPIO_Port GPIOB
#define TEST_Pin GPIO_PIN_15
#define TEST_GPIO_Port GPIOB
#define Board_LED_Pin GPIO_PIN_3
#define Board_LED_GPIO_Port GPIOE
#define USER_LED_A_Pin GPIO_PIN_14
#define USER_LED_A_GPIO_Port GPIOB
#define USER_LED_B_Pin GPIO_PIN_8
#define USER_LED_B_GPIO_Port GPIOD
#define USER_LED_C_Pin GPIO_PIN_10
#define USER_LED_C_GPIO_Port GPIOD
#define USER_LED_D_Pin GPIO_PIN_12
#define USER_LED_D_GPIO_Port GPIOD
#define TFT_RESET_Pin GPIO_PIN_14
#define TFT_RESET_GPIO_Port GPIOD
#define TFT_RD_Pin GPIO_PIN_15
#define TFT_RD_GPIO_Port GPIOD
#define TFT_WR_Pin GPIO_PIN_6
#define TFT_WR_GPIO_Port GPIOC
#define TFT_RS_Pin GPIO_PIN_7
#define TFT_RS_GPIO_Port GPIOC
#define TFT_CS_Pin GPIO_PIN_8
#define TFT_CS_GPIO_Port GPIOC

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
